; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph1 - mode
	infrared0 - mode
	spectrograph2 - mode
	GroundStation8 - direction
	GroundStation12 - direction
	Star5 - direction
	GroundStation4 - direction
	Star14 - direction
	GroundStation9 - direction
	Star6 - direction
	Star10 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star13 - direction
	GroundStation11 - direction
	Star7 - direction
	Star0 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Planet20 - direction
	Phenomenon21 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 GroundStation9)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star10)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation8)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star10)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 GroundStation9)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation11)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star2)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 GroundStation11)
	(calibration_target instrument7 Star13)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star17)
)
(:goal (and
	(pointing satellite0 GroundStation12)
	(pointing satellite2 Star0)
	(have_image Planet15 spectrograph1)
	(have_image Phenomenon16 spectrograph1)
	(have_image Star17 spectrograph1)
	(have_image Phenomenon18 infrared0)
	(have_image Star19 infrared0)
	(have_image Planet20 infrared0)
	(have_image Phenomenon21 spectrograph2)
))

)

; plan
1. (turn_to satellite2 groundstation1 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 9
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 9
3. (calibrate satellite2 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 0 of 9
4. (turn_to satellite2 planet15 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet15)
   goals met: 0 of 9
5. (take_image satellite2 planet15 instrument6 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 1 of 9
6. (turn_to satellite2 phenomenon21 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 phenomenon21)
   goals met: 1 of 9
7. (take_image satellite2 phenomenon21 instrument6 spectrograph2)
   added: (have_image phenomenon21 spectrograph2)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon18 phenomenon21)
   deleted: (pointing satellite2 phenomenon21)
   added: (pointing satellite2 phenomenon18)
   goals met: 2 of 9
9. (take_image satellite2 phenomenon18 instrument6 infrared0)
   added: (have_image phenomenon18 infrared0)
   goals met: 3 of 9
10. (turn_to satellite2 phenomenon16 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 phenomenon16)
   goals met: 3 of 9
11. (take_image satellite2 phenomenon16 instrument6 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 4 of 9
12. (turn_to satellite0 groundstation12 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation12)
   goals met: 5 of 9
13. (turn_to satellite2 planet20 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 planet20)
   goals met: 5 of 9
14. (take_image satellite2 planet20 instrument6 infrared0)
   added: (have_image planet20 infrared0)
   goals met: 6 of 9
15. (turn_to satellite2 star17 planet20)
   deleted: (pointing satellite2 planet20)
   added: (pointing satellite2 star17)
   goals met: 6 of 9
16. (take_image satellite2 star17 instrument6 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 7 of 9
17. (turn_to satellite2 star19 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star19)
   goals met: 7 of 9
18. (take_image satellite2 star19 instrument6 infrared0)
   added: (have_image star19 infrared0)
   goals met: 8 of 9
19. (turn_to satellite2 star0 star19)
   deleted: (pointing satellite2 star19)
   added: (pointing satellite2 star0)
   goals met: 9 of 9
